XLSDIR = "xls"
XLSXDIR = "xlsx"


# 图片宽高、清晰度
FGWIDTH = 13
FGHEIGHT = 5
FGDPI=150

# 是否需要处理Excel
Need_Combine_Excel=True
# 截取时间长度
Limit_Year = 20  # 截取后10列



# 计算公式 最后保存为png图片
FORMULAS = {
    "利润相关": [
        "%毛利率=(营业总收入-营业成本)/营业总收入",
        "%净利率=净利润/营业总收入"
    ],
    "费用相关": [
        "%四费总比=(销售费用+管理费用+研发费用+财务费用)/营业总收入",
        "%销售费率=销售费用/营业总收入",
        "%管理费率=管理费用/营业总收入",
        "%研发费率=研发费用/营业总收入",
        # "%财务费率=财务费用/净利润",
    ],
    "运营情况":[
        "%负债率=负债合计/资产总计",
        "%应收预付收入比=(应收票据及应收账款+其他应收款合计+预付款项)/营业总收入",
        "%应付预收收入比=(预收款项+合同负债+应付票据及应付账款)/营业总收入",
        "%存货周转率=(存货+B1存货)/2/营业成本",
        # "%固资周转率=(固定资产+在建工程+生产性生物资产)/营业总收入",

    ],
    "规模增长": [
        "营业收入=营业总收入",
        "净利润=净利润",
    ]
}

# bar堆叠图
STACK_FORMULAS = {
    "%资产性质": ["流动资产合计", "非流动资产合计"],
    "%资产细分": [
        "货币资金", 
        "应收款=应收票据及应收账款+其他应收款合计", 
        "预付款项",
        "其他流动资产",
        "存货", 
        "固资=固定资产+在建工程+生产性生物资产"
    ]
}



# 绘制图形的颜色
Define_Colors = [
    '#d87c7c',
    '#919e8b',
    '#d7ab82',
    '#6e7074',
    '#61a0a8',
    '#efa18d',
    '#787464',
    '#cc7e63',
    '#724e58',
    '#4b565b'

    '#E01F54',
    '#001852',
    '#f5e8c8',
    '#b8d2c7',
    '#c6b38e',
    '#a4d8c2',
    '#f3d999',
    '#d3758f',
    '#dcc392',
    '#2e4783',
    '#82b6e9',
    '#ff6347',
    '#a092f1',
    '#0a915d',
    '#eaf889',
    '#6699FF',
    '#ff6666',
    '#3cb371',
    '#d5b158',
    '#38b6b6'
]


# 需要处理的报表
SHEETS = [
    "资产负债表",
    "利润表",
    "现金流量表",
    "按产品(项目)分类",
    "按地区分类",
    "按项目名称展示",
    "按行业分类",
]


# 在Excel中删除的字段
FIELDS_To_REMOVE = [
    '报表类型',
    '公司类型',
    '审计意见(境内)',
    '数据来源',
    '公告日期',
    '上市前/上市后',
    "所有者权益(或股东权益):",
    "实收资本(或股本)",
    "资本公积",
    "其他综合收益",
    "专项储备",
    "盈余公积",
    "一般风险准备",
    "未分配利润",
    "归属于母公司股东权益合计",
    "少数股东权益",
    "股东权益合计",
    "负债和股东权益平衡项目",
    "负债和股东权益合计",
    "所有者权益(或股东权益)",
    "审计意见",
    "其中：应收票据",
    "应收账款",
    '数据来源：东方财富Choice数据'
]

